


Функция ВозрастВМесяцах(Знач ДатаРождения = Неопределено, Знач НаДату = Неопределено) Экспорт
	
	Результат = 0;
	
	Если (ДатаРождения <> Неопределено) И (ТипЗнч(ДатаРождения) = Тип("Дата")) Тогда
		
		Если ТипЗнч(НаДату) <> Тип("Дата") Тогда
			НаДату = ТекущаяДата();
		КонецЕсли;
		
		НаДату = НачалоДня(НаДату);
		ДатаРождения = НачалоДня(ДатаРождения);
		
		Если НаДату > ДатаРождения тогда
		
			Если ДатаРождения <> КонецМесяца(ДатаРождения) Тогда
				ДнейДатаРождения = День(ДатаРождения);
			Иначе
				ДнейДатаРождения = 30;
			КонецЕсли; 

			Если НаДату <> КонецМесяца(НаДату) Тогда
				ДнейНаДату = День(НаДату);
			Иначе
				ДнейНаДату = 30;
			КонецЕсли; 
			
			ОстатокМесяцев = Месяц(НаДату) - Месяц(ДатаРождения) - ?(ДнейНаДату > ДнейДатаРождения, 0, 1) + 12;
			ВозрастЛет = Год(НаДату) - Год(ДатаРождения) - ?(Месяц(НаДату) > Месяц(ДатаРождения), 0, 1);
		
		    Результат = ВозрастЛет * 12 + ОстатокМесяцев;
		
		КонецЕсли;    
		
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции