


Функция ВозрастВМесяцах(Знач ДатаРождения = Неопределено, Знач НаДату = Неопределено) Экспорт
	
	Результат = 0;
	
	Если (ДатаРождения <> Неопределено) И (ТипЗнч(ДатаРождения) = Тип("Дата")) Тогда
		
		Если ТипЗнч(НаДату) <> Тип("Дата") ИЛИ НачалоДня(НаДату) = '00010101' Тогда
			НаДату = ТекущаяДата();
		КонецЕсли;
		
		НаДату = НачалоДня(НаДату);
		ДатаРождения = НачалоДня(ДатаРождения);
		
		Если НаДату > ДатаРождения тогда
		
			Если ДатаРождения <> НачалоДня(КонецМесяца(ДатаРождения)) Тогда
				ДнейДатаРождения = День(ДатаРождения);
			Иначе
				ДнейДатаРождения = 30;
			КонецЕсли; 

			Если НаДату <> НачалоДня(КонецМесяца(НаДату)) Тогда
				ДнейНаДату = День(НаДату);
			Иначе
				ДнейНаДату = 30;
			КонецЕсли; 
			
			ОстатокМесяцев = Месяц(НаДату) - Месяц(ДатаРождения) - ?(ДнейНаДату >= ДнейДатаРождения, 0, 1);
			ВозрастЛет = Год(НаДату) - Год(ДатаРождения);
		
		    Результат = ВозрастЛет * 12 + ОстатокМесяцев;
		
		КонецЕсли;    
		
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции