//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯЗнаюЧтоДатаРожденияЧеловека(Парам01)","ЯЗнаюЧтоДатаРожденияЧеловека","Допустим я знаю что дата рождения человека 05.10.1985");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"МнеНужноЧтобы1СПоказалаВозрастЧеловекаВМесяцахНаДату(Парам01)","МнеНужноЧтобы1СПоказалаВозрастЧеловекаВМесяцахНаДату","И мне нужно чтобы 1С показала возраст человека в месяцах на дату 20.08.2016");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВозрастЧеловекаВМесяцахБудет(Парам01)","ВозрастЧеловекаВМесяцахБудет","Тогда возраст человека в месяцах будет 370");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим я знаю что дата рождения человека 05.10.1985
//@ЯЗнаюЧтоДатаРожденияЧеловека(Парам01)
Процедура ЯЗнаюЧтоДатаРожденияЧеловека(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//И мне нужно чтобы 1С показала возраст человека в месяцах на дату 20.08.2016
//@МнеНужноЧтобы1СПоказалаВозрастЧеловекаВМесяцахНаДату(Парам01)
Процедура МнеНужноЧтобы1СПоказалаВозрастЧеловекаВМесяцахНаДату(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда возраст человека в месяцах будет 370
//@ВозрастЧеловекаВМесяцахБудет(Парам01)
Процедура ВозрастЧеловекаВМесяцахБудет(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

//окончание текста модуля