//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯЗнаюЧтоДатаРожденияЧеловека(Парам01)","ЯЗнаюЧтоДатаРожденияЧеловека","Допустим я знаю что дата рождения человека 05.10.1985");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯЗнаюДатуРожденияЧеловека(Парам01)","ЯЗнаюДатуРожденияЧеловека","Допустим я знаю дату рождения человека: 05.10.1985");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"МнеНужноЧтобы1СПоказалаВозрастЧеловекаВМесяцахНаДату(Парам01)","МнеНужноЧтобы1СПоказалаВозрастЧеловекаВМесяцахНаДату","И мне нужно чтобы 1С показала возраст человека в месяцах на дату: 20.08.2016");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВозрастЧеловекаВМесяцахБудет(Парам01)","ВозрастЧеловекаВМесяцахБудет","Тогда возраст человека в месяцах будет: 370");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯНеЗнаюДатуРожденияЧеловека()","ЯНеЗнаюДатуРожденияЧеловека","Допустим я не знаю дату рождения человека");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВФункциюДолжноБытьПереданоЗначениеТекущейДаты()","ВФункциюДолжноБытьПереданоЗначениеТекущейДаты","Тогда в функцию должно быть передано значение текущей даты");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим я знаю дату рождения человека: 05.10.1985
//@ЯЗнаюДатуРожденияЧеловека(Парам01)
Процедура ЯЗнаюДатуРожденияЧеловека(ДатаРождения) Экспорт
	
	Контекст.Вставить("ДатаРождения", ДатаРождения);
	
КонецПроцедуры

&НаКлиенте
//И мне нужно чтобы 1С показала возраст человека в месяцах на дату 20.08.2016
//@МнеНужноЧтобы1СПоказалаВозрастЧеловекаВМесяцахНаДату(Парам01)
Процедура МнеНужноЧтобы1СПоказалаВозрастЧеловекаВМесяцахНаДату(НаДату) Экспорт
	
	Контекст.Вставить("НаДату", НаДату);
	
КонецПроцедуры

&НаКлиенте
//Тогда возраст человека в месяцах будет 370
//@ВозрастЧеловекаВМесяцахБудет(Парам01)
Процедура ВозрастЧеловекаВМесяцахБудет(ОжидаемыйВозрастВМесяцах) Экспорт
	
	ВозрастВМесяцах = ОбщегоНазначения.ВозрастВМесяцах(Контекст.ДатаРождения, Контекст.НаДату);
	
	Если ВозрастВМесяцах <> ОжидаемыйВозрастВМесяцах Тогда
		ВызватьИсключение "Возраст в месяцах расчитан не верно!";
	КонецЕсли;
	
КонецПроцедуры

//окончание текста модуля

&НаКлиенте
//Тогда в функцию должно быть передано значение текущей даты
//@ВФункциюДолжноБытьПереданоЗначениеТекущейДаты()
Процедура ВФункциюДолжноБытьПереданоЗначениеТекущейДаты() Экспорт
	
	ВозрастВМесяцах = ОбщегоНазначения.ВозрастВМесяцах(Контекст.ДатаРождения);
	ВозрастВМесяцахНаТекущуюДату = ОбщегоНазначения.ВозрастВМесяцах(Контекст.ДатаРождения, ТекущаяДата());
	
	Если ВозрастВМесяцах <> ВозрастВМесяцахНаТекущуюДату Тогда
		ВызватьИсключение "Функция рассчитана не на текущую дату!";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
//Допустим я не знаю дату рождения человека
//@ЯНеЗнаюДатуРожденияЧеловека()
Процедура ЯНеЗнаюДатуРожденияЧеловека() Экспорт
	
	Контекст.Вставить("ДатаРождения", Неопределено);
	
КонецПроцедуры
